Config/Documents/ПереносПоказателейПоСанкционированию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереносПоказателейПоСанкционированию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйГод</Name>
					<Comment>Дата окончания финансового года</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОстаткиОчередногоГода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокКредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПриемник</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОстаткиПервогоГодаЗаОчередным</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокКредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПриемник</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОстаткиВторогоГодаЗаОчередным</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДебет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокКредит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПриемник</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоПриемник3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ПереносПоказателейПоСанкционированию/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ФинансовыйГод = НачалоГода(ТекущаяДатаСеанса()) - 1;
	КонецЕсли;
	
	Если СчетаСанкционирования = Неопределено Тогда
		УстановитьВидимостьРеквизитов();
		УстановитьКоличествоСубконто();
	КонецЕсли;
	
	// заполнение список счетов для выбора
	ТаблицаСчетовСанкционирования = Документы.ПереносПоказателейПоСанкционированию.ТаблицаСчетовСанкционирования();
	СчетаТекущийГод.ЗагрузитьЗначения(ТаблицаСчетовСанкционирования.ВыгрузитьКолонку("ТекущийГод"));
	СчетаОчереднойГод.ЗагрузитьЗначения(ТаблицаСчетовСанкционирования.ВыгрузитьКолонку("ОчереднойГод"));
	СчетаОчереднойГод1.ЗагрузитьЗначения(ТаблицаСчетовСанкционирования.ВыгрузитьКолонку("ОчереднойГод1"));
	
	НастроитьФорму();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	УстановитьВидимостьРеквизитов();
	УстановитьКоличествоСубконто();
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ПроверитьВозможностьПереноса(ТекстФинансовыйГод, Объект.Организация) Тогда
		ПоказатьПредупреждениеОНевозможностиЗаписи();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	НастроитьФорму();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекстФинансовыйГод = Год(Объект.ФинансовыйГод);
	ФинансовыйГодПрежняя = ТекстФинансовыйГод;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроверитьИзменитьРеквизит("Организация", Объект.Организация, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстФинансовыйГодПриИзменении(Элемент)
	
	Если ТекстФинансовыйГод < 2000 Тогда
		ТекстФинансовыйГод = 2000;
	КонецЕсли;
	
	Если Объект.ОстаткиОчередногоГода.Количество() > 0
		ИЛИ Объект.ОстаткиПервогоГодаЗаОчередным.Количество() > 0
		ИЛИ Объект.ОстаткиВторогоГодаЗаОчередным.Количество() > 0 Тогда
		Если ТекстФинансовыйГод <> ФинансовыйГодПрежняя Тогда
			ТекстВопроса = НСтр("ru = 'При изменении финансового года табличные части будут очищены.
										|Изменить финансовый год?'");
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить финансовый год и очистить табличные части'"));
			Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять финансовый год'"));
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ТекстФинансовыйГодПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, Кнопки, 15, КодВозвратаДиалога.Да);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекстФинансовыйГодПриИзмененииДействие();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстФинансовыйГодПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ТекстФинансовыйГод = ФинансовыйГодПрежняя;
		Возврат;
	КонецЕсли;
	
	Объект.ОстаткиОчередногоГода.Очистить();
	Объект.ОстаткиПервогоГодаЗаОчередным.Очистить();
	Объект.ОстаткиВторогоГодаЗаОчередным.Очистить();
	
	ТекстФинансовыйГодПриИзмененииДействие();

КонецПроцедуры

&НаКлиенте
Процедура ТекстФинансовыйГодПриИзмененииДействие()
	
	Объект.ФинансовыйГод = Дата(ТекстФинансовыйГод, 12, 31, 23, 59, 59);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыОстаткиОчередногоГода

&НаКлиенте
Процедура ОстаткиОчередногоГодаСчетПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ОграниченияСписокСчетов, ТекущаяСтрока",
									СчетаТекущийГод, 
									Элементы.ОстаткиОчередногоГода.ТекущиеДанные.СчетПриемник);
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОчередногоГодаСубконтоПриемник1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОчередногоГодаСубконтоПриемник1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
													 Элементы.ОстаткиОчередногоГода.ТекущиеДанные.СубконтоПриемник1,
													,
													"СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОчередногоГодаСубконтоПриемник2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОчередногоГодаСубконтоПриемник2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
													 Элементы.ОстаткиОчередногоГода.ТекущиеДанные.СубконтоПриемник2,
													,
													"СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОчередногоГодаСубконтоПриемник3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОчередногоГодаСубконтоПриемник3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
													 Элементы.ОстаткиОчередногоГода.ТекущиеДанные.СубконтоПриемник3,
													,
													"СубконтоПриемник");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыОстаткиПервогоГодаЗаОчередным

&НаКлиенте
Процедура ОстаткиПервогоГодаЗаОчереднымСчетПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ОграниченияСписокСчетов, ТекущаяСтрока", СчетаОчереднойГод, Элементы.ОстаткиПервогоГодаЗаОчередным.ТекущиеДанные.СчетПриемник);
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПервогоГодаЗаОчереднымСубконтоПриемник1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПервогоГодаЗаОчереднымСубконтоПриемник1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
											Элементы.ОстаткиПервогоГодаЗаОчередным.ТекущиеДанные.СубконтоПриемник1,
											,
											"СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПервогоГодаЗаОчереднымСубконтоПриемник2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПервогоГодаЗаОчереднымСубконтоПриемник2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
											Элементы.ОстаткиПервогоГодаЗаОчередным.ТекущиеДанные.СубконтоПриемник2,
											,
											"СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПервогоГодаЗаОчереднымСубконтоПриемник3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПервогоГодаЗаОчереднымСубконтоПриемник3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
											Элементы.ОстаткиПервогоГодаЗаОчередным.ТекущиеДанные.СубконтоПриемник3,
											,
											"СубконтоПриемник");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыОстаткиВторогоГодаЗаОчередным

&НаКлиенте
Процедура ОстаткиВторогоГодаЗаОчереднымСчетПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ОграниченияСписокСчетов, ТекущаяСтрока",
									СчетаОчереднойГод1, 
									Элементы.ОстаткиВторогоГодаЗаОчередным.ТекущиеДанные.СчетПриемник);
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВторогоГодаЗаОчереднымСубконтоПриемник1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВторогоГодаЗаОчереднымСубконтоПриемник1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
											Элементы.ОстаткиВторогоГодаЗаОчередным.ТекущиеДанные.СубконтоПриемник1,
											,
											"СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВторогоГодаЗаОчереднымСубконтоПриемник2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВторогоГодаЗаОчереднымСубконтоПриемник2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
											Элементы.ОстаткиВторогоГодаЗаОчередным.ТекущиеДанные.СубконтоПриемник2,
											,
											"СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВторогоГодаЗаОчереднымСубконтоПриемник3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоПриемник");
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВторогоГодаЗаОчереднымСубконтоПриемник3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,	
													 ДанныеВыбора, 
													 СтандартнаяОбработка, 
													 Объект.Организация, 
											Элементы.ОстаткиВторогоГодаЗаОчередным.ТекущиеДанные.СубконтоПриемник3,
											,
											"СубконтоПриемник");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если НЕ ЗаполнитьДокумент() Тогда
		ПоказатьПредупреждениеОНевозможностиЗаписи();
	КонецЕсли;	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура КомандаОтменитьПроведение(Команда)
	
	Если НЕ Объект.Проведен Тогда
		Возврат;                                  
	КонецЕсли;	
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
	ПараметрыЗаписи.Вставить("ИсходныйРежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
	Записать(ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьПредупреждениеОНевозможностиЗаписи()
	ПоказатьПредупреждение(,НСтр("ru = 'Существует документ Закрытие счетов санкционирования завершаемого финансового года 
	|с включенной опцией ""Перерегистрировать бюджетные данные"", перенос показателей не может быть выполнен.'"));
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму() 
	
	ТолькоПросмотр = Объект.Проведен;
	
	Если НЕ ДатыЗапретаИзменения.ИзменениеЗапрещено("Документ.ПереносПоказателейПоСанкционированию", Объект.Ссылка)
		И ПравоДоступа("ОтменаПроведения", Метаданные.Документы.ПереносПоказателейПоСанкционированию) Тогда
		Элементы.ФормаКнопкаОтменитьПроведение.Видимость = Истина;
	КонецЕсли;	
			
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьДокумент()
	
	Если НЕ ПроверитьВозможностьПереноса(ТекстФинансовыйГод, Объект.Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСчетовСанкционирования.ТекущийГод,
	|	ТаблицаСчетовСанкционирования.ОчереднойГод,
	|	ТаблицаСчетовСанкционирования.ОчереднойГод1,
	|	ТаблицаСчетовСанкционирования.ОчереднойГод2
	|ПОМЕСТИТЬ ВсеСчета
	|ИЗ
	|	&ТаблицаСчетовСанкционирования КАК ТаблицаСчетовСанкционирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.КЭК,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение
	|ПОМЕСТИТЬ Остатки1
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ПериодКонец,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ВсеСчета.ТекущийГод
	|				ИЗ
	|					ВсеСчета КАК ВсеСчета
	|			
	|				ОБЪЕДИНИТЬ ВСЕ
	|			
	|				ВЫБРАТЬ
	|					ВсеСчета.ОчереднойГод
	|				ИЗ
	|					ВсеСчета КАК ВсеСчета
	|			
	|				ОБЪЕДИНИТЬ ВСЕ
	|			
	|				ВЫБРАТЬ
	|					ВсеСчета.ОчереднойГод1
	|				ИЗ
	|					ВсеСчета КАК ВсеСчета
	|			
	|				ОБЪЕДИНИТЬ ВСЕ
	|			
	|				ВЫБРАТЬ
	|					ВсеСчета.ОчереднойГод2
	|				ИЗ
	|					ВсеСчета КАК ВсеСчета),
	|			,
	|			Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ИФО,
	|	Остатки.КФО,
	|	Остатки.КПС,
	|	Остатки.КЭК,
	|	Остатки.Счет,
	|	Остатки.Подразделение,
	|	Остатки.Субконто1,
	|	Остатки.Субконто2,
	|	Остатки.Субконто3,
	|	Остатки.СуммаОстатокДт КАК ОстатокДебет,
	|	Остатки.СуммаОстатокКт КАК ОстатокКредит,
	|	ВсеСчета.ТекущийГод КАК СчетПриемник,
	|	Остатки.Субконто1 КАК СубконтоПриемник1,
	|	Остатки.Субконто2 КАК СубконтоПриемник2,
	|	Остатки.Субконто3 КАК СубконтоПриемник3
	|ИЗ
	|	ВсеСчета КАК ВсеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки1 КАК Остатки
	|		ПО ВсеСчета.ОчереднойГод = Остатки.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ИФО,
	|	Остатки.КФО,
	|	Остатки.КПС,
	|	Остатки.КЭК,
	|	Остатки.Счет,
	|	Остатки.Подразделение,
	|	Остатки.Субконто1,
	|	Остатки.Субконто2,
	|	Остатки.Субконто3,
	|	Остатки.СуммаОстатокДт КАК ОстатокДебет,
	|	Остатки.СуммаОстатокКт КАК ОстатокКредит,
	|	ВсеСчета.ОчереднойГод КАК СчетПриемник,
	|	Остатки.Субконто1 КАК СубконтоПриемник1,
	|	Остатки.Субконто2 КАК СубконтоПриемник2,
	|	Остатки.Субконто3 КАК СубконтоПриемник3
	|ИЗ
	|	ВсеСчета КАК ВсеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки1 КАК Остатки
	|		ПО ВсеСчета.ОчереднойГод1 = Остатки.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ИФО,
	|	Остатки.КФО,
	|	Остатки.КПС,
	|	Остатки.КЭК,
	|	Остатки.Счет,
	|	Остатки.Подразделение,
	|	Остатки.Субконто1,
	|	Остатки.Субконто2,
	|	Остатки.Субконто3,
	|	Остатки.СуммаОстатокДт КАК ОстатокДебет,
	|	Остатки.СуммаОстатокКт КАК ОстатокКредит,
	|	ВсеСчета.ОчереднойГод1 КАК СчетПриемник,
	|	Остатки.Субконто1 КАК СубконтоПриемник1,
	|	Остатки.Субконто2 КАК СубконтоПриемник2,
	|	Остатки.Субконто3 КАК СубконтоПриемник3
	|ИЗ
	|	ВсеСчета КАК ВсеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки1 КАК Остатки
	|		ПО ВсеСчета.ОчереднойГод2 = Остатки.Счет";
	
	Запрос.УстановитьПараметр("ПериодКонец", 					НачалоГода(Объект.ФинансовыйГод+1));

	Запрос.УстановитьПараметр("Организация", 					Объект.Организация);
	Запрос.УстановитьПараметр("ТаблицаСчетовСанкционирования", 	Документы.ПереносПоказателейПоСанкционированию.ТаблицаСчетовСанкционирования());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Объект.ОстаткиОчередногоГода.Загрузить(РезультатЗапроса[2].Выгрузить());
	Объект.ОстаткиПервогоГодаЗаОчередным.Загрузить(РезультатЗапроса[3].Выгрузить());
	Объект.ОстаткиВторогоГодаЗаОчередным.Загрузить(РезультатЗапроса[4].Выгрузить());

	УстановитьКоличествоСубконто();
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьДокумент()

&НаКлиенте
Процедура ПроверитьИзменитьРеквизит(ИмяРеквизита, СтароеЗначение, ВыбранноеЗначение)
	
	// если реквизит не изменился, то и менять нечего
	Если СтароеЗначение = ВыбранноеЗначение Тогда
		Возврат;
	КонецЕсли;
	
	// если документ пустой, то можно менять любой реквизит
	Если Объект.ОстаткиОчередногоГода.Количество() = 0
		И Объект.ОстаткиПервогоГодаЗаОчередным.Количество() = 0
		И Объект.ОстаткиВторогоГодаЗаОчередным.Количество() = 0 Тогда
		
		Объект[ИмяРеквизита] = ВыбранноеЗначение;
		
		Возврат;
		
	КонецЕсли;

	Если ИмяРеквизита = "Организация" Тогда
		ПараметрыПодстановки = Новый Структура("Реквизит1, Реквизит2", "организации", "организацию");
	Иначе
		Объект[ИмяРеквизита] = ВыбранноеЗначение;
		Возврат;
	КонецЕсли;
		
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
								НСтр("ru = 'При изменении [Реквизит1] документ будет очищен.
											|Изменить [Реквизит2]?'"),
								ПараметрыПодстановки);
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
											НСтр("ru = 'Изменить [Реквизит2] и очистить документ'"),
											ПараметрыПодстановки));
	Кнопки.Добавить(КодВозвратаДиалога.Нет, СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
											НСтр("ru = 'Не изменять [Реквизит2]'"),
											ПараметрыПодстановки));

	ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьИзменитьРеквизитЗавершение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение, ИмяРеквизита", ВыбранноеЗначение, ИмяРеквизита)), ТекстВопроса,Кнопки,15,КодВозвратаДиалога.Нет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзменитьРеквизитЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ВыбранноеЗначение 	= ДополнительныеПараметры.ВыбранноеЗначение;
	ИмяРеквизита 		= ДополнительныеПараметры.ИмяРеквизита;
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОстаткиОчередногоГода.Очистить();
	Объект.ОстаткиПервогоГодаЗаОчередным.Очистить();
	Объект.ОстаткиВторогоГодаЗаОчередным.Очистить();
	
	Объект[ИмяРеквизита] = ВыбранноеЗначение;

КонецПроцедуры // МожноИзменятьРеквизит()

&НаСервере
Процедура УстановитьВидимостьРеквизитов()

	СчетаСписком = Истина;
	СписокСчетовСанкционирования = Документы.ПереносПоказателейПоСанкционированию
											.ТаблицаСчетовСанкционирования(СчетаСписком);
	СвойстваСчетов = БухгалтерскийУчет.ПолучитьСвойстваСчетов(СписокСчетовСанкционирования, 
																Ложь, 
																"УчетПоПодразделениям, КоличествоСубконто");
	
	УчетПоПодразделениям = Ложь;
	КоличествоСубконто = 0;
	
	Соответствие = Новый Соответствие;
	Для каждого ТекСчет Из СвойстваСчетов Цикл
	
		СтруктураСвойств = Новый Структура("УчетПоПодразделениям, КоличествоСубконто");
		ЗаполнитьЗначенияСвойств(СтруктураСвойств, ТекСчет.Значение);
		
		УчетПоПодразделениям = Макс(УчетПоПодразделениям, СтруктураСвойств.УчетПоПодразделениям);
		КоличествоСубконто = Макс(КоличествоСубконто, СтруктураСвойств.КоличествоСубконто);
		Соответствие.Вставить(ТекСчет.Ключ, Новый ФиксированнаяСтруктура(СтруктураСвойств));
	
	КонецЦикла; 
	
	СчетаСанкционирования = Новый ФиксированноеСоответствие(Соответствие);
	
	Элементы.ОстаткиОчередногоГодаПодразделение.Видимость 			= УчетПоПодразделениям;
	Элементы.ОстаткиПервогоГодаЗаОчереднымПодразделение.Видимость 	= УчетПоПодразделениям;
	Элементы.ОстаткиВторогоГодаЗаОчереднымПодразделение.Видимость 	= УчетПоПодразделениям;
	
	Для Индекс = КоличествоСубконто + 1 По БухгалтерскийУчетПовтИсп.ПолучитьМаксКоличествоСубконто() Цикл
	
		Элементы["ОстаткиОчередногоГодаСубконто"+Индекс].Видимость 					= Ложь;	
		Элементы["ОстаткиОчередногоГодаСубконтоПриемник"+Индекс].Видимость 			= Ложь;	
		Элементы["ОстаткиПервогоГодаЗаОчереднымСубконто"+Индекс].Видимость 			= Ложь;	
		Элементы["ОстаткиПервогоГодаЗаОчереднымСубконтоПриемник"+Индекс].Видимость 	= Ложь;	
		Элементы["ОстаткиВторогоГодаЗаОчереднымСубконто"+Индекс].Видимость 			= Ложь;	
		Элементы["ОстаткиВторогоГодаЗаОчереднымСубконтоПриемник"+Индекс].Видимость	= Ложь;	
	     
	КонецЦикла; 
	
	Если НЕ ПроверитьВозможностьПереноса(ТекстФинансовыйГод, Объект.Организация) Тогда
		Элементы.ФормаЗаполнить.Доступность = Ложь;	
	КонецЕсли;

КонецПроцедуры // ВидимостьРеквизитов()

&НаСервере
Процедура УстановитьКоличествоСубконто()

	Для каждого ТекСтр Из Объект.ОстаткиОчередногоГода Цикл
	
		ТекСчет = СчетаСанкционирования.Получить(ТекСтр.Счет);
		Если ТекСчет <> Неопределено Тогда
			ТекСтр.КоличествоСубконто 	= ТекСчет.КоличествоСубконто;
			ТекСтр.УчетПоПодразделениям = ТекСчет.УчетПоПодразделениям;
		КонецЕсли;
	
		ТекСчет = СчетаСанкционирования.Получить(ТекСтр.СчетПриемник);
		Если ТекСчет <> Неопределено Тогда
			ТекСтр.КоличествоСубконтоПриемник = ТекСчет.КоличествоСубконто;
		КонецЕсли;
	
	КонецЦикла; 	
	Для каждого ТекСтр Из Объект.ОстаткиПервогоГодаЗаОчередным Цикл
	
		ТекСчет = СчетаСанкционирования.Получить(ТекСтр.Счет);
		Если ТекСчет <> Неопределено Тогда
			ТекСтр.КоличествоСубконто 	= ТекСчет.КоличествоСубконто;
			ТекСтр.УчетПоПодразделениям = ТекСчет.УчетПоПодразделениям;
		КонецЕсли;
	
		ТекСчет = СчетаСанкционирования.Получить(ТекСтр.СчетПриемник);
		Если ТекСчет <> Неопределено Тогда
			ТекСтр.КоличествоСубконтоПриемник = ТекСчет.КоличествоСубконто;
		КонецЕсли;
	
	КонецЦикла; 	
	Для каждого ТекСтр Из Объект.ОстаткиВторогоГодаЗаОчередным Цикл
	
		ТекСчет = СчетаСанкционирования.Получить(ТекСтр.Счет);
		Если ТекСчет <> Неопределено Тогда
			ТекСтр.КоличествоСубконто 	= ТекСчет.КоличествоСубконто;
			ТекСтр.УчетПоПодразделениям = ТекСчет.УчетПоПодразделениям;
		КонецЕсли;
	
		ТекСчет = СчетаСанкционирования.Получить(ТекСтр.СчетПриемник);
		Если ТекСчет <> Неопределено Тогда
			ТекСтр.КоличествоСубконтоПриемник = ТекСчет.КоличествоСубконто;
		КонецЕсли;
	
	КонецЦикла; 	

КонецПроцедуры // УстановитьКоличествоСубконто()

&НаСервереБезКонтекста
Функция ПроверитьВозможностьПереноса(ФинГод, ОбъектОрганизация)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗакрытиеСчетовСанкционирования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСчетовСанкционирования КАК ЗакрытиеСчетовСанкционирования
	|ГДЕ
	|	ЗакрытиеСчетовСанкционирования.Организация = &Организация
	|	И ГОД(ЗакрытиеСчетовСанкционирования.ФинансовыйГод) = &ФинансовыйГод
	|	И ЗакрытиеСчетовСанкционирования.ПеререгистрироватьБюджетныеДанные = ИСТИНА
	|	И ЗакрытиеСчетовСанкционирования.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ФинансовыйГод",  ФинГод);
	Запрос.УстановитьПараметр("Организация",  ОбъектОрганизация);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции	
	
#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
